snlkuharlocal/src/Documents/ЭлТранспортнаяНакладная/ЭлТранспортнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлТранспортнаяНакладная</name>
  <comment>Электронная транспортная накладная</comment>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПолучателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПоследнегоИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказная</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказнаяМашина</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтЛицо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистЗагрузки</name>
    <type>
      <types>DocumentRef.ЛистЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Логист</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераНакладных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительФИО</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПеревозчика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пломба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сертиф</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>Адрес из пункта доставки, может не совпадать с конечной точкой</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПодачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактВремяПодачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактВремяУбытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоподъемностьАвто</name>
    <comment>Грузоподъемность, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемАвто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГЛНКонечногоПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводДокументы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерХодки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПогрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладная</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСФ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСФ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиСсылка</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НакладнаяСсылка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Брутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Нетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСФ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСФ</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнформационныеПоля</name>
    <attributes>
      <name>НаименованиеПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИнфоПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЭлТранспортнаяНакладная/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда
	Иначе
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);			
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);	
		
		//Кухарь 23.04.17 начало
		//2 новых реквизита
		если ЭтоНовый() тогда
			Автор=ПараметрыСеанса.Пользователь;
		КонецЕсли;
		АвторПоследнегоИзменения=ПараметрыСеанса.Пользователь;
		
		//По просьбе Лисицкого, для отчётов
		ДатаПоследнегоИзменения=ТекущаяДата();
		Если ЗаказнаяМашина.Водитель.НеИспользовать Тогда
			#Если Клиент Тогда
				Сообщить("Ошибка: выбран запрещенный к использованию водитель: "+ЗаказнаяМашина.Водитель+"!");	
			#КонецЕсли
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;		
	
	Если Отказ Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
	
	
КонецПроцедуры


Функция ПолучитьКоличествоИОбъемПаллет (Получатель)
	
	Запрос=новый запрос;
	Запрос.Текст= "ВЫБРАТЬ
	|	ЗаявкаНаОтгрузкуНакладные.Получатель КАК Получатель,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаНаОтгрузкуНакладные.Накладная ССЫЛКА Документ.РасходнаяНакладная
	|				ТОГДА ВЫРАЗИТЬ(ЗаявкаНаОтгрузкуНакладные.Накладная КАК Документ.РасходнаяНакладная).КоличествоПаллет
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПаллет,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаявкаНаОтгрузкуНакладные.Накладная ССЫЛКА Документ.РасходнаяНакладная
	|				ТОГДА ВЫРАЗИТЬ(ЗаявкаНаОтгрузкуНакладные.Накладная КАК Документ.РасходнаяНакладная).ОбъемПаллет
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемПаллет
	|ИЗ
	|	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	|ГДЕ
	|	ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	|	И ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен
	|	И НЕ ЗаявкаНаОтгрузкуНакладные.НеОтгружать
	|	И ЗаявкаНаОтгрузкуНакладные.Получатель = &Получатель
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаОтгрузкуНакладные.Получатель";
	запрос.УстановитьПараметр("ДатаОтгрузки",НачалоДня(дата));
	запрос.УстановитьПараметр("Получатель",Получатель);
	Возврат запрос.Выполнить().Выгрузить();
	
КонецФункции



//Функция ПолучитьГрузоПолучателя (строкаТЧ=Неопределено,ВыводитьПоСтрокеТЧ=ложь)
//	// Кухарь А.Ю.  28.09.2022 начало
//	//Иногда нужно заменять юридический адрес - фактическим
//	
//	  // Андреев И.Д. 29.01.2025 начало
//	  //ЗаменятьЮрАдресФактическим=ложь; 
//	
//ЗаменятьЮрАдресФактическим=ложь; 
//	

//	   
//	  // Андреев И.Д. 29.01.2025 конец
//	  
//		
//	// Кухарь А.Ю.  28.09.2022 конец
//	
//	
//	СписокГрузополучателей="";
//		если  ПустаяСтрока(склад) и не ВыводитьПоСтрокеТЧ тогда
//	
//	//	если Общая И ПустаяСтрока(склад) и не ВыводитьПоСтрокеТЧ тогда
//	
//		для каждого строкаТЧ из Накладные Цикл 			
//			
//			если ТипЗнч(строкаТЧ.Получатель)=Тип("СправочникСсылка.Склады") тогда
//				Получатель=Организация;
//				ИННПолучателя=Организация.инн;
//			иначе
//				Получатель=строкаТЧ.получатель;
//				ИННПолучателя=Получатель.инн;
//				
//				
//				попытка
//					если ЗначениеЗаполнено(строкаТЧ.НакладнаяСсылка.ТипДоставки) тогда
//						ТипДоставки=строкаТЧ.НакладнаяСсылка.ТипДоставки;
//					иначе
//						ТипДоставки=строкаТЧ.ПунктДоставкиСсылка.ТипДоставки;
//					КонецЕсли;
//				Исключение
//					ТипДоставки=строкаТЧ.ПунктДоставкиСсылка.ТипДоставки;
//				КонецПопытки;
//				
//				// Кухарь А.Ю.  21.06.2022 начало
//				//Для общих ТН переопределим тип доставки 
//				если строкаТЧ.НакладнаяСсылка=Неопределено тогда 
//					СписокРНК=НайтиСписокРНК(строкаТЧ);
//					если СписокРНК.количество()>0 тогда
//						ТекРНК=СписокРНК.получить(0).значение;
//						попытка
//							если ЗначениеЗаполнено(ТекРНК.ТипДоставки) тогда
//								ТипДоставки=ТекРНК.ТипДоставки;
//							иначе
//								ТипДоставки=строкаТЧ.ПунктДоставкиСсылка.ТипДоставки;
//							КонецЕсли;
//						Исключение
//							ТипДоставки=строкаТЧ.ПунктДоставкиСсылка.ТипДоставки;
//						КонецПопытки;	
//					КонецЕсли;
//				КонецЕсли;				 
//				// Кухарь А.Ю.  21.06.2022 конец
//				
//				
//				
//				если ТипДоставки<>Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
//					Получатель=строкаТЧ.Получатель;
//				иначе
//					
//					// Кухарь А.Ю.  16.11.2023 начало
//					// Получатель=строкаТЧ.ПунктДоставкиСсылка.ТраспортнаяКомпания;	
//					если ТипЗнч(строкаТЧ.НакладнаяСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") и ЗначениеЗаполнено(строкаТЧ.НакладнаяСсылка.ТранспортнаяКомпания) тогда
//						Получатель=строкаТЧ.НакладнаяСсылка.ТранспортнаяКомпания;
//					иначе
//						Получатель=строкаТЧ.ПунктДоставкиСсылка.ТраспортнаяКомпания;	
//					КонецЕсли;			 
//					// Кухарь А.Ю.  16.11.2023 конец
//					
//				КонецЕсли;
//			КонецЕсли;		
//			
//			
//			//Кухарь 24.01.17 конец
//			
//			ВремГо=""+получатель+" "+получатель.ЮридическийАдрес+" ИНН "+ИННПолучателя;
//			если Найти(СписокГрузополучателей,ВремГО)=0 тогда
//				СписокГрузополучателей =СписокГрузополучателей+ВремГО+". ";
//			КонецЕсли;		
//		КонецЦикла;	
//		возврат СписокГрузополучателей;
//	//ИначеЕсли СвернутьПоПодразделениям и не ВыводитьПоСтрокеТЧ тогда 
//	//	если ТипЗнч(строкаТЧ.Получатель)=Тип("СправочникСсылка.Склады") тогда
//	//		Получатель=Организация;
//	//		ИННПолучателя=Организация.инн;
//	//		
//	//	иначе
//	//		Получатель=строкаТЧ.Получатель;
//	//		ИННПолучателя=Получатель.инн;
//	//		
//	//	КонецЕсли;
//	//	
//	//	если ЗначениеЗаполнено(строкаТЧ.ПунктДоставкиСсылка.ПечГрузополучательТорг12) тогда
//	//		возврат строкаТЧ.ПунктДоставкиСсылка.ПечГрузополучательТорг12;				
//	//	иначе
//	//		возврат ""+Получатель + ". "+Получатель.ЮридическийАдрес+"ИНН "+ИННПолучателя;					
//	//	КонецЕсли;
//		
//	иначе
//		если ТипЗнч(строкаТЧ.Получатель)=Тип("СправочникСсылка.Склады") тогда
//			Получатель=Организация;
//			ИННПолучателя=Организация.инн;
//			
//		иначе
//			Получатель=строкаТЧ.Получатель;
//			ИННПолучателя=Получатель.инн;
//			// Кухарь А.Ю.  28.09.2022 начало
//			//Иногда нужно заменять юридический адрес - фактическим
//			ЗаменятьЮрАдресФактическим=ПроверитьЗаменуЮрАдресаФактическим(Получатель); 
//			// Кухарь А.Ю.  28.09.2022 конец
//			
//		КонецЕсли;
//			
//		// Кухарь А.Ю.  28.09.2022 начало
//		//возврат ""+Получатель + ". "+Получатель.ЮридическийАдрес+"ИНН "+ИННПолучателя;
//		АдресГрузополучателя=Получатель.ЮридическийАдрес;
//		если ЗаменятьЮрАдресФактическим тогда
//			если ЗначениеЗаполнено(строкаТЧ.ПунктДоставкиСсылка) тогда
//				АдресГрузополучателя=строкаТЧ.ПунктДоставкиСсылка.АдресПолучателя;
//			КонецЕсли;
//		КонецЕсли;
//		
//		возврат ""+Получатель + ". "+АдресГрузополучателя+"ИНН "+ИННПолучателя;	
//		// Кухарь А.Ю.  28.09.2022 конец
//		
//	КонецЕсли;			
//КонецФункции
//   
//// Кухарь А.Ю.  28.09.2022 начало
////Иногда нужно заменять юридический адрес - фактическим
//Функция ПроверитьЗаменуЮрАдресаФактическим(Получатель)
//	если ложь тогда получатель=Справочники.Контрагенты.ПустаяСсылка();КонецЕсли;
//	Результат=ложь;
//	если ТипЗнч(Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
//		если ЗначениеЗаполнено(Получатель.НаборПечатныхФорм) тогда
//			СтрокаТЧ=Получатель.НаборПечатныхФорм.Список.Найти("ТТН","ВыходнаяФорма");
//			если СтрокаТЧ<>Неопределено и СтрокаТЧ.ПечататьПочтовыйАдресвСФ тогда
//				результат=Истина
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//	возврат Результат;
//КонецФункции
//// Кухарь А.Ю.  28.09.2022 конец



//// Андреев И.Д. 14.05.2025 начало
//функция ПолучитьАдресДоставкиИВыгрузки (строкаТч=Неопределено); 
//	Ошибка = ложь;	
//	АдрВыгр="";
//	АдрДост="";
//	
//	//---------------------------------------------------------
//	// Заполнение Пункта 2 Трн
//	//Если есть ссылка, то из неё     
//	
//	Если строкаТч.НакладнаяСсылка <> неопределено или ЗначениеЗаполнено(строкаТч.НакладнаяСсылка) тогда	
//		
//		ТипДоставки  = "";      
//		
//		Если  значениеЗаполнено(строкаТЧ.ПунктДоставкиСсылка) тогда   
//			ТипДоставки  = строкаТЧ.ПунктДоставкиСсылка.типДоставки;
//		иначе
//			ТипДоставки = строкаТч.НакладнаяСсылка.пунктДоставки.типДоставки	
//		КонецЕсли;
//		
//		если  ТипДоставки = перечисления.ТипыДоставки.ТранспортнаяКомпания тогда 
//			//тк	 
//			
//			Если  ТипЗнч(строкаТч.НакладнаяСсылка) <> Тип("ДокументСсылка.ЗаявкаВТранспортныйОтдел")тогда 					
//				АдрДост = строкаТч.НакладнаяСсылка.ПунктДоставки.адресПолучателя;  
//			иначе 
//				АдрДост = строкаТч.НакладнаяСсылка.ПунктДоставкиПолучатель;
//			КонецЕсли;
//			
//			
//		ИначеЕсли  строкаТЧ.ПунктДоставкиСсылка.ТипДоставки = перечисления.ТипыДоставки.Перегруз тогда	
//			
//			//Перегруз
//			Попытка 										
//				Если строкаТч.НакладнаяСсылка.адресПерегруза = справочники.ПунктыДоставки.ПустаяСсылка() тогда	
//					АдрДост = строкаТч.НакладнаяСсылка.ПунктДоставки.пунктПерегруза;		
//				иначе
//					АдрДост = строкаТч.НакладнаяСсылка.адресПерегруза; 								
//				КонецЕсли;											
//			Исключение					
//				АдрДост = строкаТч.НакладнаяСсылка.ПунктПерегрузаПолучатель;						
//			конецПопытки;									
//		Иначеесли ТипДоставки = перечисления.ТипыДоставки.Доставка тогда 
//			
//			//Доставка
//			попытка
//				АдрДост = строкаТч.Адрес; 
//			исключение
//				АдрДост = строкаТч.НакладнаяСсылка.ПунктДоставкиПолучатель;
//			КонецПопытки; 
//			
//			//Самовывоз	
//		Иначеесли ТипДоставки = перечисления.ТипыДоставки.Самовывоз тогда 	
//			АдрДост = строкаТЧ.Отправитель.Адрес; 
//			
//		КонецЕсли;
//		
//		// Заполнение Пункта 10 Трн			
//		//---------------------------------------------------------				
//		если  ТипДоставки = перечисления.ТипыДоставки.ТранспортнаяКомпания тогда 					
//			// Если доставка - Тк, а получатель Табер Трейд или Гиперглобус, то Приравниваем пункты 2 и 10
//			Если строкаТЧ.получатель = Справочники.Контрагенты.НайтиПоКоду("SSP-3698") или строкаТЧ.получатель = Справочники.Контрагенты.НайтиПоКоду("SSP-3180")
//				тогда          				
//				АдрВыгр = АдрДост;	
//				// Если доставка любой другой тк - Пункт 10 из финальной точки доставки тк					
//			Иначе	 					
//				Попытка
//					АдрВыгр = строкаТЧ.НакладнаяСсылка.ПунктДоставки.АдресПолучателя;
//				исключение
//					АдрВыгр = строкаТч.НакладнаяСсылка.ПунктПерегрузаПолучатель;
//				КонецПопытки;										
//			КонецЕсли;	
//			
//		иначеесли ТипДоставки	 = перечисления.ТипыДоставки.Перегруз тогда   
//			// Если перегруз - то финальная точка доставки	
//			АдрВыгр = строкаТЧ.ПунктДоставки;
//		Иначе
//			// В любом другом случае пункт 2 = пунткту 10	
//			АдрВыгр = АдрДост;	
//		КонецЕсли;		
//		
//		//---------------------------------------------------------	
//		// Если нет ссылки на накладную, то ищем накладную по списку
//	Иначе
//		
//		СписокРНК = НайтиСписокРНК(строкаТЧ); 
//		Если СписокРНК <> неопределено тогда   
//			// Тз:https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4566 	
//			
//		Попытка	
//			РнкСсылка = СписокРНК.получить(0);
//		Исключение
//		Сообщить("По строчке с накладными:" +строкаТЧ.Накладная+ ", не найдено документов!");
//		Ошибка = истина;
//		Возврат(Ошибка);
//		Конецпопытки;	
//			
//			
//			
//			
//			// Андреев И.Д. 24.04.2025 конец
//			//тк - адрес из адреса доставки тк из пд
//			
//			
//			если  рнкСсылка.значение.ТипДоставки = перечисления.ТипыДоставки.ТранспортнаяКомпания тогда     
//				
//				
//				Если  ТипЗнч(строкаТч.НакладнаяСсылка) <> Тип("ДокументСсылка.ЗаявкаВТранспортныйОтдел")тогда 					
//					АдрДост = РнкСсылка.значение.ПунктДоставки.адресПолучателя;  
//				иначе 
//					АдрДост = РнкСсылка.значение.ПунктДоставкиПолучатель;
//				КонецЕсли;
//				
//				//Перегруз. Адрес перегруза из рнк, если не заполнен то из пд
//				
//			ИначеЕсли  рнкСсылка.значение.ТипДоставки = перечисления.ТипыДоставки.Перегруз тогда						
//				Попытка 
//					
//					Если РнкСсылка.Значение.адресПерегруза = справочники.ПунктыДоставки.ПустаяСсылка() тогда	
//						АдрДост = РнкСсылка.Значение.ПунктДоставки.пунктПерегруза;		
//					иначе
//						АдрДост = РнкСсылка.Значение.адресПерегруза; 								
//					КонецЕсли;												
//				Исключение						
//					АдрДост = РнкСсылка.Значение.ПунктПерегрузаПолучатель;								
//				конецПопытки;
//				
//				//Доставка
//				
//			Иначеесли  рнкСсылка.значение.ТипДоставки = перечисления.ТипыДоставки.Доставка тогда     
//				
//				попытка
//					АдрДост = РнкСсылка.Значение.ПунктДоставки.АдресПолучателя; 
//				исключение
//					АдрДост = РнкСсылка.Значение.ПунктДоставкиПолучатель;
//				КонецПопытки;  
//				
//				// Андреев И.Д. 14.05.2025 начало
//				//самовывоз		
//			Иначеесли  рнкСсылка.значение.ТипДоставки = перечисления.ТипыДоставки.Самовывоз тогда 	
//				
//				АдрДост = СтрокаТч.Отправитель.Адрес; 
//				
//				// Андреев И.Д. 14.05.2025 конец
//				
//			КонецЕсли;
//			
//			// можно использовать юр. адрес если не заполнен почтовый в перевозчике   
//			//
//			//---------------------------------------------------------
//			// Заполнение Пункта 10 Трн
//			
//			если  рнкСсылка.значение.ТипДоставки  = перечисления.ТипыДоставки.ТранспортнаяКомпания тогда  
//				// Если доставка - Тк, а получатель Табер Трейд или Гиперглобус, то Приравниваем пункты 2 и 10
//				
//				Если строкаТЧ.получатель = Справочники.Контрагенты.НайтиПоКоду("SSP-3698") или строкаТЧ.получатель = Справочники.Контрагенты.НайтиПоКоду("SSP-3180")
//					тогда          				
//					АдрВыгр = АдрДост;	
//				Иначе	 					
//					Попытка
//						АдрВыгр = РнкСсылка.значение.ПунктДоставки.АдресПолучателя;
//					исключение
//						АдрВыгр = РнкСсылка.значение.ПунктДоставкиПолучатель;
//					КонецПопытки;										
//				КонецЕсли;				
//			иначеесли рнкСсылка.значение.ТипДоставки 	 = перечисления.ТипыДоставки.Перегруз тогда  
//				// Если перегруз - то финальная точка доставки
//				АдрВыгр = строкаТЧ.ПунктДоставки; 
//				
//				// В любом другом случае пункт 2 = пунткту 10
//			Иначе	
//				АдрВыгр = АдрДост;
//			КонецЕсли;		
//		КонецЕсли;
//	КонецЕсли;	
//	//---------------------------------------------------------
//	
//	Структура = новый структура;
//	Структура.Вставить("АдрВыгр",АдрВыгр);
//	Структура.Вставить("АдрДост",АдрДост);
//	
//	Возврат(Структура);	
//	
//КонецФункции
//// Андреев И.Д. 14.05.2025 конец
